content/posts/nix.md
+++
title = "Nix/NixOS"
author = ["Jethro Kuan"]
lastmod = 2020-06-07T17:27:46+08:00
draft = false
+++

NixOS is a [Linux]({{< relref "linux" >}}) [operating System]({{< relref "operating_systems" >}}) built upon the Nix package manager. Nix
refers to both the package manager, and the name of the [programming
language]({{< relref "prog_lang" >}}) it is written in.

## Nix Software {#nix-software}

- [target/lorri](https://github.com/target/lorri) provides great [direnv](https://direnv.net/) ([Unix]({{< relref "unix" >}})) /nix-shell integration
- [nmattia/niv](https://github.com/nmattia/niv) provides dependency management for Nix projects

## Links {#links}

- [nix-community/awesome-nix](https://github.com/nix-community/awesome-nix)
- [NixOS Weekly Newsletter](https://weekly.nixos.org/)
- [Nix Pills](https://nixos.org/nixos/nix-pills/)
- [Nix Shorts](https://github.com/justinwoo/nix-shorts)

## Articles {#articles}

- [I was Wrong about Nix - Christine Dodrill](https://christine.website/blog/i-was-wrong-about-nix-2020-02-10)
